vmud20/vmud20.github.io/dataset/macros4sig/openenclave/macro_bcac8e7acb514429fee9e0b5d0c7a0308fd4d76b~1_cc13334ca-syscall.c.h
#define __OE_IOVEC oe_iovec
#define __OE_MSGHDR oe_msghdr
#define __OE_SOCKADDR_STORAGE oe_sockaddr_storage
#define OE_FD_SETSIZE 1024

#define __OE_FD_SET oe_fd_set

#define OE_POLLERR    0x008
#define OE_POLLHUP    0x010
#define OE_POLLIN     0x001
#define OE_POLLMSG    0x400
#define OE_POLLNVAL   0x020
#define OE_POLLOUT    0x004
#define OE_POLLPRI    0x002
#define OE_POLLRDBAND 0x080
#define OE_POLLRDHUP  0x2000
#define OE_POLLRDNORM 0x040
#define OE_POLLWRBAND 0x200
#define OE_POLLWRNORM 0x100

#define OE_MS_RDONLY 1

#define OE_TIOCGWINSZ 0x5413

#define OE_RAISE_ERRNO(ERRNO)                                  \
    do                                                         \
    {                                                          \
        int __err = ERRNO;                                     \
        oe_log(OE_LOG_LEVEL_ERROR, "oe_errno=%d [%s %s:%d]\n", \
            __err, "__FILE__", __FUNCTION__, "__LINE__");          \
        oe_errno = __err;                                      \
        goto done;                                             \
    }                                                          \
    while (0)
#define OE_RAISE_ERRNO_MSG(ERRNO, FMT, ...)                         \
    do                                                              \
    {                                                               \
        int __err = ERRNO;                                          \
        oe_log(OE_LOG_LEVEL_ERROR, FMT " oe_errno=%d [%s %s:%d]\n", \
           ##__VA_ARGS__, __err, "__FILE__", __FUNCTION__, "__LINE__"); \
        oe_errno = __err;                                           \
        goto done;                                                  \
    }                                                               \
    while (0)

#define OE_DEVICE_NAME_CONSOLE_FILE_SYSTEM "oe_console_file_system"
#define OE_DEVICE_NAME_HOST_EPOLL "oe_host_epoll"
#define OE_DEVICE_NAME_HOST_FILE_SYSTEM OE_HOST_FILE_SYSTEM
#define OE_DEVICE_NAME_HOST_SOCKET_INTERFACE "oe_host_socket_interface"
#define OE_DEVICE_NAME_SGX_FILE_SYSTEM OE_SGX_FILE_SYSTEM




#define OE_EPOLL_CTL_ADD 1
#define OE_EPOLL_CTL_DEL 2
#define OE_EPOLL_CTL_MOD 3

#define OE_LLD(_X_) _X_
#define OE_LLU(_X_) _X_
#define OE_LLX(_X_) _X_


#define __OE_SIGSET_NWORDS (1024 / (8 * sizeof(unsigned long int)))
#define OE_HOST_FILE_SYSTEM "oe_host_file_system"

#define E2BIG OE_E2BIG
#define EACCES OE_EACCES
#define EADDRINUSE OE_EADDRINUSE
#define EADDRNOTAVAIL OE_EADDRNOTAVAIL
#define EADV OE_EADV
#define EAFNOSUPPORT OE_EAFNOSUPPORT
#define EAGAIN OE_EAGAIN
#define EALREADY OE_EALREADY
#define EBADE OE_EBADE
#define EBADF OE_EBADF
#define EBADFD OE_EBADFD
#define EBADMSG OE_EBADMSG
#define EBADR OE_EBADR
#define EBADRQC OE_EBADRQC
#define EBADSLT OE_EBADSLT
#define EBFONT OE_EBFONT
#define EBUSY OE_EBUSY
#define ECANCELED OE_ECANCELED
#define ECHILD OE_ECHILD
#define ECHRNG OE_ECHRNG
#define ECOMM OE_ECOMM
#define ECONNABORTED OE_ECONNABORTED
#define ECONNREFUSED OE_ECONNREFUSED
#define ECONNRESET OE_ECONNRESET
#define EDEADLK OE_EDEADLK
#define EDEADLOCK OE_EDEADLOCK
#define EDESTADDRREQ OE_EDESTADDRREQ
#define EDOM OE_EDOM
#define EDOTDOT OE_EDOTDOT
#define EDQUOT OE_EDQUOT
#define EEXIST OE_EEXIST
#define EFAULT OE_EFAULT
#define EFBIG OE_EFBIG
#define EHOSTDOWN OE_EHOSTDOWN
#define EHOSTUNREACH OE_EHOSTUNREACH
#define EHWPOISON OE_EHWPOISON
#define EIDRM OE_EIDRM
#define EILSEQ OE_EILSEQ
#define EINPROGRESS OE_EINPROGRESS
#define EINTR OE_EINTR
#define EINVAL OE_EINVAL
#define EIO OE_EIO
#define EISCONN OE_EISCONN
#define EISDIR OE_EISDIR
#define EISNAM OE_EISNAM
#define EKEYEXPIRED OE_EKEYEXPIRED
#define EKEYREJECTED OE_EKEYREJECTED
#define EKEYREVOKED OE_EKEYREVOKED
#define EL2HLT OE_EL2HLT
#define EL2NSYNC OE_EL2NSYNC
#define EL3HLT OE_EL3HLT
#define EL3RST OE_EL3RST
#define ELIBACC OE_ELIBACC
#define ELIBBAD OE_ELIBBAD
#define ELIBEXEC OE_ELIBEXEC
#define ELIBMAX OE_ELIBMAX
#define ELIBSCN OE_ELIBSCN
#define ELNRNG OE_ELNRNG
#define ELOOP OE_ELOOP
#define EMEDIUMTYPE OE_EMEDIUMTYPE
#define EMFILE OE_EMFILE
#define EMLINK OE_EMLINK
#define EMSGSIZE OE_EMSGSIZE
#define EMULTIHOP OE_EMULTIHOP
#define ENAMETOOLONG OE_ENAMETOOLONG
#define ENAVAIL OE_ENAVAIL
#define ENETDOWN OE_ENETDOWN
#define ENETRESET OE_ENETRESET
#define ENETUNREACH OE_ENETUNREACH
#define ENFILE OE_ENFILE
#define ENOANO OE_ENOANO
#define ENOBUFS OE_ENOBUFS
#define ENOCSI OE_ENOCSI
#define ENODATA OE_ENODATA
#define ENODEV OE_ENODEV
#define ENOENT OE_ENOENT
#define ENOEXEC OE_ENOEXEC
#define ENOKEY OE_ENOKEY
#define ENOLCK OE_ENOLCK
#define ENOLINK OE_ENOLINK
#define ENOMEDIUM OE_ENOMEDIUM
#define ENOMEM OE_ENOMEM
#define ENOMSG OE_ENOMSG
#define ENONET OE_ENONET
#define ENOPKG OE_ENOPKG
#define ENOPROTOOPT OE_ENOPROTOOPT
#define ENOSPC OE_ENOSPC
#define ENOSR OE_ENOSR
#define ENOSTR OE_ENOSTR
#define ENOSYS OE_ENOSYS
#define ENOTBLK OE_ENOTBLK
#define ENOTCONN OE_ENOTCONN
#define ENOTDIR OE_ENOTDIR
#define ENOTEMPTY OE_ENOTEMPTY
#define ENOTNAM OE_ENOTNAM
#define ENOTRECOVERABLE OE_ENOTRECOVERABLE
#define ENOTSOCK OE_ENOTSOCK
#define ENOTSUP OE_ENOTSUP
#define ENOTTY OE_ENOTTY
#define ENOTUNIQ OE_ENOTUNIQ
#define ENXIO OE_ENXIO
#define EOPNOTSUPP OE_EOPNOTSUPP
#define EOVERFLOW OE_EOVERFLOW
#define EOWNERDEAD OE_EOWNERDEAD
#define EPERM OE_EPERM
#define EPFNOSUPPORT OE_EPFNOSUPPORT
#define EPIPE OE_EPIPE
#define EPROTO OE_EPROTO
#define EPROTONOSUPPORT OE_EPROTONOSUPPORT
#define EPROTOTYPE OE_EPROTOTYPE
#define ERANGE OE_ERANGE
#define EREMCHG OE_EREMCHG
#define EREMOTE OE_EREMOTE
#define EREMOTEIO OE_EREMOTEIO
#define ERESTART OE_ERESTART
#define ERFKILL OE_ERFKILL
#define EROFS OE_EROFS
#define ESHUTDOWN OE_ESHUTDOWN
#define ESOCKTNOSUPPORT OE_ESOCKTNOSUPPORT
#define ESPIPE OE_ESPIPE
#define ESRCH OE_ESRCH
#define ESRMNT OE_ESRMNT
#define ESTALE OE_ESTALE
#define ESTRPIPE OE_ESTRPIPE
#define ETIME OE_ETIME
#define ETIMEDOUT OE_ETIMEDOUT
#define ETOOMANYREFS OE_ETOOMANYREFS
#define ETXTBSY OE_ETXTBSY
#define EUCLEAN OE_EUCLEAN
#define EUNATCH OE_EUNATCH
#define EUSERS OE_EUSERS
#define EWOULDBLOCK OE_EWOULDBLOCK
#define EXDEV OE_EXDEV
#define EXFULL OE_EXFULL
#define OE_E2BIG            7
#define OE_EACCES          13
#define OE_EADDRINUSE      98
#define OE_EADDRNOTAVAIL   99
#define OE_EADV            68
#define OE_EAFNOSUPPORT    97
#define OE_EAGAIN          11
#define OE_EALREADY        114
#define OE_EBADE           52
#define OE_EBADF            9
#define OE_EBADFD          77
#define OE_EBADMSG         74
#define OE_EBADR           53
#define OE_EBADRQC         56
#define OE_EBADSLT         57
#define OE_EBFONT          59
#define OE_EBUSY           16
#define OE_ECANCELED       125
#define OE_ECHILD          10
#define OE_ECHRNG          44
#define OE_ECOMM           70
#define OE_ECONNABORTED    103
#define OE_ECONNREFUSED    111
#define OE_ECONNRESET      104
#define OE_EDEADLK         35
#define OE_EDEADLOCK       OE_EDEADLK
#define OE_EDESTADDRREQ    89
#define OE_EDOM            33
#define OE_EDOTDOT         73
#define OE_EDQUOT          122
#define OE_EEXIST          17
#define OE_EFAULT          14
#define OE_EFBIG           27
#define OE_EHOSTDOWN       112
#define OE_EHOSTUNREACH    113
#define OE_EHWPOISON       133
#define OE_EIDRM           43
#define OE_EILSEQ          84
#define OE_EINPROGRESS     115
#define OE_EINTR            4
#define OE_EINVAL          22
#define OE_EIO              5
#define OE_EISCONN         106
#define OE_EISDIR          21
#define OE_EISNAM          120
#define OE_EKEYEXPIRED     127
#define OE_EKEYREJECTED    129
#define OE_EKEYREVOKED     128
#define OE_EL2HLT          51
#define OE_EL2NSYNC        45
#define OE_EL3HLT          46
#define OE_EL3RST          47
#define OE_ELIBACC         79
#define OE_ELIBBAD         80
#define OE_ELIBEXEC        83
#define OE_ELIBMAX         82
#define OE_ELIBSCN         81
#define OE_ELNRNG          48
#define OE_ELOOP           40
#define OE_EMEDIUMTYPE     124
#define OE_EMFILE          24
#define OE_EMLINK          31
#define OE_EMSGSIZE        90
#define OE_EMULTIHOP       72
#define OE_ENAMETOOLONG    36
#define OE_ENAVAIL         119
#define OE_ENETDOWN        100
#define OE_ENETRESET       102
#define OE_ENETUNREACH     101
#define OE_ENFILE          23
#define OE_ENOANO          55
#define OE_ENOBUFS         105
#define OE_ENOCSI          50
#define OE_ENODATA         61
#define OE_ENODEV          19
#define OE_ENOENT           2
#define OE_ENOEXEC          8
#define OE_ENOKEY          126
#define OE_ENOLCK          37
#define OE_ENOLINK         67
#define OE_ENOMEDIUM       123
#define OE_ENOMEM          12
#define OE_ENOMSG          42
#define OE_ENONET          64
#define OE_ENOPKG          65
#define OE_ENOPROTOOPT     92
#define OE_ENOSPC          28
#define OE_ENOSR           63
#define OE_ENOSTR          60
#define OE_ENOSYS          38
#define OE_ENOTBLK         15
#define OE_ENOTCONN        107
#define OE_ENOTDIR         20
#define OE_ENOTEMPTY       39
#define OE_ENOTNAM         118
#define OE_ENOTRECOVERABLE 131
#define OE_ENOTSOCK        88
#define OE_ENOTSUP         OE_EOPNOTSUPP
#define OE_ENOTTY          25
#define OE_ENOTUNIQ        76
#define OE_ENXIO            6
#define OE_EOPNOTSUPP      95
#define OE_EOVERFLOW       75
#define OE_EOWNERDEAD      130
#define OE_EPERM            1
#define OE_EPFNOSUPPORT    96
#define OE_EPIPE           32
#define OE_EPROCLIM        134
#define OE_EPROTO          71
#define OE_EPROTONOSUPPORT 93
#define OE_EPROTOTYPE      91
#define OE_ERANGE          34
#define OE_EREMCHG         78
#define OE_EREMOTE         66
#define OE_EREMOTEIO       121
#define OE_ERESTART        85
#define OE_ERFKILL         132
#define OE_EROFS           30
#define OE_ESHUTDOWN       108
#define OE_ESOCKTNOSUPPORT 94
#define OE_ESPIPE          29
#define OE_ESRCH            3
#define OE_ESRMNT          69
#define OE_ESTALE          116
#define OE_ESTRPIPE        86
#define OE_ETIME           62
#define OE_ETIMEDOUT       110
#define OE_ETOOMANYREFS    109
#define OE_ETXTBSY         26
#define OE_EUCLEAN         117
#define OE_EUNATCH         49
#define OE_EUSERS          87
#define OE_EWOULDBLOCK     OE_EAGAIN
#define OE_EXDEV           18
#define OE_EXFULL          54

#define errno oe_errno
#define oe_errno *__oe_errno_location()
#define OE_AT_FDCWD (-100)
#define OE_AT_REMOVEDIR 0x200
#define OE_F_DUPFD          0
#define OE_F_GETFD          1
#define OE_F_GETFL          3
#define OE_F_GETLK          5
#define OE_F_GETLK64       OE_F_GETLK
#define OE_F_GETOWN         9
#define OE_F_GETOWNER_UIDS 17
#define OE_F_GETOWN_EX     16
#define OE_F_GETSIG        11
#define OE_F_OFD_GETLK     36
#define OE_F_OFD_SETLK     37
#define OE_F_OFD_SETLKW    38
#define OE_F_SETFD          2
#define OE_F_SETFL          4
#define OE_F_SETLK          6
#define OE_F_SETLK64       OE_F_SETLK
#define OE_F_SETLKW         7
#define OE_F_SETLKW64      OE_F_SETLKW
#define OE_F_SETOWN         8
#define OE_F_SETOWN_EX     15
#define OE_F_SETSIG        10
#define OE_O_APPEND        000002000
#define OE_O_ASYNC         000020000
#define OE_O_CLOEXEC       002000000
#define OE_O_CREAT         000000100
#define OE_O_DIRECT        000040000
#define OE_O_DIRECTORY     000200000
#define OE_O_DSYNC         000010000
#define OE_O_EXCL          000000200
#define OE_O_LARGEFILE     000000000
#define OE_O_NDELAY        O_NONBLOCK
#define OE_O_NOATIME       001000000
#define OE_O_NOCTTY        000000400
#define OE_O_NOFOLLOW      000400000
#define OE_O_NONBLOCK      000004000
#define OE_O_PATH          010000000
#define OE_O_RDONLY        000000000
#define OE_O_RDWR          000000002
#define OE_O_RSYNC         004010000
#define OE_O_SYNC          004010000
#define OE_O_TMPFILE       020200000
#define OE_O_TRUNC         000001000
#define OE_O_WRONLY        000000001

#define oe_flock64 oe_flock
#define OE_DT_BLK 6
#define OE_DT_CHR 2
#define OE_DT_DIR 4
#define OE_DT_FIFO 1
#define OE_DT_LNK 10
#define OE_DT_REG 8
#define OE_DT_SOCK 12
#define OE_DT_UNKNOWN 0
#define OE_DT_WHT 14

#define CHAR_BIT OE_CHAR_BIT
#define CHAR_MAX OE_CHAR_MAX
#define CHAR_MIN OE_CHAR_MIN
#define INT_MAX OE_INT_MAX
#define INT_MIN OE_INT_MIN
#define IOV_MAX OE_IOV_MAX
#define LLONG_MAX OE_LLONG_MAX
#define LLONG_MIN OE_LLONG_MIN
#define LONG_MAX OE_LONG_MAX
#define LONG_MIN OE_LONG_MIN
#define NAME_MAX OE_NAME_MAX
#define NGROUPS_MAX OE_NGROUPS_MAX
#define OE_IOV_MAX 1024
#define OE_NAME_MAX 255
#define OE_NGROUPS_MAX 32
#define OE_PATH_MAX 4096
#define PATH_MAX OE_PATH_MAX
#define SCHAR_MAX OE_SCHAR_MAX
#define SCHAR_MIN OE_SCHAR_MIN
#define SHRT_MAX OE_SHRT_MAX
#define SHRT_MIN OE_SHRT_MIN
#define UCHAR_MAX OE_UCHAR_MAX
#define UINT_MAX OE_UINT_MAX
#define ULLONG_MAX OE_ULLONG_MAX
#define ULONG_MAX OE_ULONG_MAX
#define USHRT_MAX OE_USHRT_MAX

#define SAFE_ADD(a, b, c, minz, maxz) \
    return __builtin_add_overflow(a, b, c) ? OE_INTEGER_OVERFLOW : OE_OK;
#define SAFE_MULTIPLY(a, b, c, minz, maxz) \
    return __builtin_mul_overflow(a, b, c) ? OE_INTEGER_OVERFLOW : OE_OK;
#define SAFE_SUBTRACT(a, b, c, minz, maxz) \
    return __builtin_sub_overflow(a, b, c) ? OE_INTEGER_OVERFLOW : OE_OK;

#define __has_builtin(x) 0


#define OE_RESTRICT restrict





#define BUFSIZ OE_BUFSIZ
#define EOF (-1)

#define INT16_MAX OE_INT16_MAX
#define INT16_MIN OE_INT16_MIN
#define INT32_MAX OE_INT32_MAX
#define INT32_MIN OE_INT32_MIN
#define INT64_MAX OE_INT64_MAX
#define INT64_MIN OE_INT64_MIN
#define INT8_MAX OE_INT8_MAX
#define INT8_MIN OE_INT8_MIN
#define SIZE_MAX OE_SIZE_MAX
#define UINT16_MAX OE_UINT16_MAX
#define UINT32_MAX OE_UINT32_MAX
#define UINT64_MAX OE_UINT64_MAX
#define UINT8_MAX OE_UINT8_MAX

#define OE_BUFSIZ 8192
#define OE_EOF (-1)

#define stderr oe_stderr
#define stdin oe_stdin
#define stdout oe_stdout

#define __OE_JMP_BUF oe_jmp_buf
#define ___OE_JMP_BUF _oe_jmp_buf
